onlinefitness/app/controllers/users_controller.rb

  def calendar
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "created_at", "updated_at", "weight", "gender", "birthday", "height") VALUES('Hii', '2010-11-01 01:56:49', '2010-11-01 01:56:49', 0, 'Male', '2010-11-01 00:00:00', 0)