onlinefitness/app/controllers/workouts_controller.rb

SELECT * FROM "workouts" WHERE ("workouts"."id" = 1 AND ("workouts".user_id = 1))
---
  def show
    @workout = @user.workouts.find(params[:id])

SELECT * FROM "workouts" WHERE ("workouts"."id" = 1 AND ("workouts".user_id = 1))
---
  def edit
    @workout = @user.workouts.find(params[:id])

INSERT INTO "workouts" ("expectedsets", "actualsets", "created_at", "updated_at", "date", "expectedreps", "exercise", "actualreps", "user_id") VALUES(1, NULL, '2010-11-01 01:58:52', '2010-11-01 01:58:52', '2010-11-01 00:00:00', 1, 'Biceps', NULL, 1)
---
  def create
    @workout = @user.workouts.build(params[:workout])

    respond_to do |format|
      if @workout.save

SELECT * FROM "workouts" WHERE ("workouts"."id" = 1 AND ("workouts".user_id = 1))
DELETE FROM "workouts" WHERE "id" = 1
---
  def destroy
    @workout = @user.workouts.find(params[:id])
    @workout.destroy